In [141]:
import numpy as np
import pandas as pd

In [142]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [143]:
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

In [144]:
df.dtypes

Airline          object
FlightNumber    float64
From_To          object
RecentDelays     object
dtype: object

## 1.

In [145]:
df1 = df['FlightNumber'].fillna(method='ffill')
df1

0    10045.0
1    10045.0
2    10065.0
3    10065.0
4    10085.0
Name: FlightNumber, dtype: float64

In [146]:
for i in range(len(df1)):
    if df.loc[i, 'FlightNumber'] != df1.loc[i]:
        df.loc[i, 'FlightNumber'] = df1.iloc[i] + 10

df['FlightNumber'] = df['FlightNumber'].astype('int64')
df.dtypes

Airline         object
FlightNumber     int64
From_To         object
RecentDelays    object
dtype: object

In [147]:
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)         10045      LoNDon_paris      [23, 47]
1    <Air France> (12)         10055      MAdrid_miLAN            []
2  (British Airways. )         10065  londON_StockhOlm  [24, 43, 87]
3       12. Air France         10075    Budapest_PaRis          [13]
4          "Swiss Air"         10085   Brussels_londOn      [67, 32]

## 2.

In [148]:
df2 = [getattr(row, 'From_To').split('_') for row in df.itertuples()]
df2

[['LoNDon', 'paris'],
 ['MAdrid', 'miLAN'],
 ['londON', 'StockhOlm'],
 ['Budapest', 'PaRis'],
 ['Brussels', 'londOn']]

In [149]:
df2_temp = pd.DataFrame(df2, columns= ['From', 'To'])
df2_temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

## 3.

In [150]:
df3_From = [getattr(row, 'From').capitalize() for row in df2_temp.itertuples()]
df3_To = [getattr(row, 'To').capitalize() for row in df2_temp.itertuples()]
df3_From, df3_To

(['London', 'Madrid', 'London', 'Budapest', 'Brussels'],
 ['Paris', 'Milan', 'Stockholm', 'Paris', 'London'])

In [151]:
df2_temp['From'] = df3_From
df2_temp['To'] = df3_To
df2_temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

## 4.

In [152]:
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)         10045      LoNDon_paris      [23, 47]
1    <Air France> (12)         10055      MAdrid_miLAN            []
2  (British Airways. )         10065  londON_StockhOlm  [24, 43, 87]
3       12. Air France         10075    Budapest_PaRis          [13]
4          "Swiss Air"         10085   Brussels_londOn      [67, 32]

In [153]:
del df['From_To']

In [154]:
df

               Airline  FlightNumber  RecentDelays
0               KLM(!)         10045      [23, 47]
1    <Air France> (12)         10055            []
2  (British Airways. )         10065  [24, 43, 87]
3       12. Air France         10075          [13]
4          "Swiss Air"         10085      [67, 32]

In [155]:
df['From'] = df2_temp['From']
df['To'] = df2_temp['To']
df = pd.DataFrame(df, columns=['Airline', 'FlightNumber', 'From', 'To', 'RecentDelays'])
df

               Airline  FlightNumber      From         To  RecentDelays
0               KLM(!)         10045    London      Paris      [23, 47]
1    <Air France> (12)         10055    Madrid      Milan            []
2  (British Airways. )         10065    London  Stockholm  [24, 43, 87]
3       12. Air France         10075  Budapest      Paris          [13]
4          "Swiss Air"         10085  Brussels     London      [67, 32]

## 5.

In [156]:
df5 = pd.DataFrame(df['RecentDelays'] )
df5

   RecentDelays
0      [23, 47]
1            []
2  [24, 43, 87]
3          [13]
4      [67, 32]

In [157]:
data = [row for index, row in df5.itertuples()]
data

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [158]:
df5 = pd.DataFrame(data, columns=['delay_1', 'delay_2', 'delay_3'])
df5

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [159]:
del df['RecentDelays']

In [160]:
pd.concat([df, df5], axis=1)

,Airline,FlightNumber,From,To,delay_1,delay_2,delay_3
0,KLM(!),10045,London,Paris,23.0,47.0,NaN
1,<Air France> (12),10055,Madrid,Milan,NaN,NaN,NaN
2,(British Airways. ),10065,London,Stockholm,24.0,43.0,87.0
3,12. Air France,10075,Budapest,Paris,13.0,NaN,NaN
4,"""Swiss Air""",10085,Brussels,London,67.0,32.0,NaN